{
  "replacing": {

  },
  "dependencies": {
    "db_mysql": [

    ],
    "rails": [

    ],
    "resource:repo['default']": [

    ],
    "mysql::client": [

    ],
    "web_apache": [

    ],
    "passenger_apache2::mod_rails": [

    ]
  },
  "groupings": {

  },
  "long_description": "= DESCRIPTION:\n\n= REQUIREMENTS:\n\n= ATTRIBUTES: \n\n= USAGE:\n\n",
  "recommendations": {

  },
  "description": "Installs the rails application server on apache+passenger.",
  "maintainer": "RightScale, Inc.",
  "name": "app_rails",
  "suggestions": {

  },
  "maintainer_email": "support@rightscale.com",
  "conflicting": {

  },
  "recipes": {
    "app_rails::setup_db_config": "Configures the rails database.yml file.",
    "app_rails::do_db_restore": "Restore the application database schema from a remote location.",
    "app_rails::install_rails": "Installs the rails application server.",
    "app_rails::do_update_code": "Update application source files from the remote repository.",
    "app_rails::default": "Runs app_rails::install_rails."
  },
  "platforms": {

  },
  "version": "0.0.1",
  "attributes": {
    "rails\/application_port": {
      "default": "8000",
      "calculated": false,
      "type": "string",
      "choice": [

      ],
      "description": "This input is normally set to 8000 if this server is a combined HAProxy and application server. If this is an application server (w\/o HAproxy), set it to 80.  When setting this in a deployment, you should use 80 at the deployment level since you want all of your servers in the array to use this value.  If the server is a FE+APP server, you can set it to 8000 at the server level so that it overrides the deployment level input.",
      "display_name": "Application Port",
      "recipes": [
        "app_rails::install_rails",
        "app_rails::default"
      ],
      "required": "optional"
    },
    "rails\/db_mysqldump_file_path": {
      "calculated": false,
      "type": "string",
      "choice": [

      ],
      "description": "This input allows you to restore your database by choosing a specific MySQL database backup file.  You will need to specify a full path and\/or filename.  Ex: branch\/mydb-200910300402.gz",
      "display_name": "Mysqldump File Path",
      "recipes": [
        "app_rails::do_db_restore"
      ],
      "required": "optional"
    },
    "rails": {
      "calculated": false,
      "type": "hash",
      "choice": [

      ],
      "display_name": "Rails Passenger Settings",
      "recipes": [

      ],
      "required": "optional"
    },
    "rails\/gems_list": {
      "calculated": false,
      "type": "array",
      "choice": [

      ],
      "description": "An optional list of gems that's required by your application.",
      "display_name": "Gems List",
      "recipes": [
        "app_rails::install_rails",
        "app_rails::default"
      ],
      "required": "optional"
    },
    "rails\/db_schema_name": {
      "calculated": false,
      "type": "string",
      "choice": [

      ],
      "description": "Enter the name of the MySQL database schema to which applications will connect.  The database schema was created when the initial database was first set up.  This input will be used to set the application server's database config file so that applications can connect to the correct schema within the database.  This input is also used for MySQL dump backups in order to determine which schema is getting backed up.  Ex: mydbschema",
      "display_name": "Database Schema Name",
      "recipes": [
        "app_rails::do_db_restore"
      ],
      "required": "required"
    },
    "rails\/db_app_passwd": {
      "calculated": false,
      "type": "string",
      "choice": [

      ],
      "description": "If the MySQL administrator set up a restricted MySQL account for application servers to access the database, then specify the password of that account for this input.  If there is not a restricted MySQL account then use the same value that's used for 'Database Admin Password'.  The application server will then have unrestricted access to the database.",
      "display_name": "Database Password",
      "recipes": [
        "app_rails::do_db_restore"
      ],
      "required": "required"
    },
    "rails\/server_name": {
      "default": "myserver",
      "calculated": false,
      "type": "string",
      "choice": [

      ],
      "description": "The fully qualified domain name of the application server used to define your virtual host.",
      "display_name": "Server Name",
      "recipes": [
        "app_rails::do_db_restore",
        "app_rails::do_update_code",
        "app_rails::install_rails",
        "app_rails::default"
      ],
      "required": "optional"
    },
    "rails\/application_name": {
      "default": "myapp",
      "calculated": false,
      "type": "string",
      "choice": [

      ],
      "description": "Sets the directory for your application's web files (\/home\/webapps\/Application Name\/current\/).  If you have multiple applications, you can run the code checkout script multiple times, each with a different value for 'Application Name', so each application will be stored in a unique directory.  This must be a valid directory name.  Do not use symbols in the name.",
      "display_name": "Application Name",
      "recipes": [
        "app_rails::install_rails",
        "app_rails::default"
      ],
      "required": "optional"
    },
    "rails\/db_app_user": {
      "calculated": false,
      "type": "string",
      "choice": [

      ],
      "description": "If the MySQL administrator set up a restricted MySQL account for application servers to access the database, then specify the username of that account for this input.  If there is not a restricted MySQL account then use the same value that's used for 'Database Admin Username'.  The application server will then have unrestricted access to the database.",
      "display_name": "Database User",
      "recipes": [
        "app_rails::do_db_restore",
        "app_rails::install_rails",
        "app_rails::default"
      ],
      "required": "required"
    }
  },
  "providing": {

  },
  "license": "Copyright (c) 2010 RightScale, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n'Software'), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and\/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
}