{
    "version": "0.1.0",
    "recipes": {
      "app::request_loadbalancer_deny": "Sends request to all application servers tagged with loadbalancer:app=<applistener_name> to deny connections from the caller's private IP address.  This should be run on a load balancer after disconnecting application servers or upon decommissioning.",
      "app::default": "Adds the appserver:active=true tag to your server which identifies it as an application server. This tag is used by database servers, for example, for opening firewall ports.",
      "app::do_loadbalancers_allow": "Allow connections from all load balancers within a given listener pool which are tagged with loadbalancer:lb=<applistener_name>.  This should be run on an application server before requesting connection to load balancers.",
      "app::request_loadbalancer_allow": "Sends request to all application servers tagged with loadbalancer:app=<applistener_name> to allow connections from the caller's private IP address. This should be run on a load balancer before attaching application servers.",
      "app::do_loadbalancers_deny": "Deny connections from all load balancers which are tagged with loadbalancer:lb=<applistener_name>. This can be run on an application server to deny connections from all load balancers within a given listener pool."
    },
    "maintainer_email": "support@rightscale.com",
    "conflicting": {
    },
    "attributes": {
    },
    "providing": {
    },
    "dependencies": {
      "sys_firewall": [

      ]
    },
    "replacing": {
    },
    "license": "All rights reserved",
    "groupings": {
    },
    "long_description": "= DESCRIPTION:\n\nRightScale application server management cookbook (beta) \n\nThis cookbook contains recipes that generally applicable to all application\nservers.\n\n= REQUIREMENTS:\n\nRequires a VM launched from a RightScale managed RightImage \n       \n= USAGE:\n\nAdd the default recipe to tag your server as an appserver. This is used by \nservers (like databases) to identify their clients.\n",
    "recommendations": {
    },
    "name": "app",
    "maintainer": "RightScale, Inc.",
    "suggestions": {
    },
    "platforms": {
    },
    "description": "Common utilities for RightScale managed application servers"
  }